/********************************************************************
**文件名称:        my_gsensor.h
**文件描述:        QMI8658B 六轴传感器基础接口
*********************************************************************/

#ifndef _MY_GSENSOR_H_
#define _MY_GSENSOR_H_

typedef struct
{
    int32_t acc_x_mg;
    int32_t acc_y_mg;
    int32_t acc_z_mg;
    int32_t gyr_x_mdps;
    int32_t gyr_y_mdps;
    int32_t gyr_z_mdps;
} my_gsensor_data_t;

/********************************************************************
**函数名称:  my_gsensor_init
**入口参数:  tid      ---        任务 ID 存储地址
**出口参数:  tid      ---        未创建任务时写入 NULL
**函数功能:  初始化 QMI8658B 六轴传感器
**返回值:    0 表示成功，负值表示失败
*********************************************************************/
int my_gsensor_init(k_tid_t *tid);

/********************************************************************
**函数名称:  my_gsensor_pwr_on
**入口参数:  on       ---        true 开启，false 关闭
**出口参数:  无
**函数功能:  控制六轴传感器供电
**返回值:    0 表示成功，负值表示失败
*********************************************************************/
int my_gsensor_pwr_on(bool on);

/********************************************************************
**函数名称:  my_gsensor_read_data
**入口参数:  无
**出口参数:  data     ---        六轴换算数据
**函数功能:  读取 QMI8658B 当前六轴数据
**返回值:    0 表示成功，负值表示失败
*********************************************************************/
int my_gsensor_read_data(my_gsensor_data_t *data);

/********************************************************************
**函数名称:  get_chip_id
**入口参数:  无
**出口参数:  无
**函数功能:  获取 QMI8658B 芯片ID
**返 回 值:  QMI8658B 芯片ID
*********************************************************************/
uint8_t get_chip_id(void);

#endif
